import numpy as np # type: ignore

# Конфігурація додатку
class Config:
    PLOT_DPI = 300
    EXPORT_FOLDER = "Експорт_симуляції"
    PLOTS_FOLDER = "Графіки_симуляції"
    MIN_ROWS = 8
    MIN_COLS = 2
    PARAM_NAMES = ['lambda1', 's1', 's2', 'N', 'D1', 'lambda2', 's2b', 'D2']
    PLOT_COLORS = ['blue', 'green', 'red', 'purple', 'orange', 'brown']
    PLOT_MARKERS = ['o', 's', '^', 'D', 'v', '>']
    PARAMETER_NAMES = [
            "λ1 (інтенсивність потоку подій МРЧ)",
            "s1 (тривалість первинної обробки)",
            "s2 (тривалість вторинної обробки подій МРЧ)",
            "N (кількість подій для моделювання)",
            "Deadline 1",
            "λ2 (частота подій жорсткого)",
            "s2b (тривалість вторинної обробки подій жорсткого РЧ)",
            "Deadline 2"
            ]

    METRIC_NAMES = [
            "Середній час очікування первинної обробки",
            "Середній час очікування вторинної обробки для подій м'якого РЧ",
            "Середній час очікування вторинної обробки для подій жорсткого РЧ",
            "Середній повний час перебування події м'якого РЧ у системі",
            "Середній повний час перебування подій жорсткого РЧ у системі",
            "Максимальний час очікування первинної обробки",
            "Максимальний час очікування вторинної обробки подій м'якого РЧ",
            "Максимальний час очікування вторинної обробки подій жорсткого РЧ",
            "Максимальний повний час перебування подій м'якого РЧ у системі",
            "Максимальний повний час перебування подій жорсткого РЧ у системі",
            "Середня довжина черги первинного обробника",
            "Середня довжина черги вторинного обробника для подій м'якого РЧ",
            "Середня довжина черги вторинного обробника для подій жорсткого РЧ",
            "Коефіцієнт завантаження первинного обробника",
            "Коефіцієнт завантаження вторинного обробника подіями м'якого РЧ",
            "Коефіцієнт завантаження вторинного обробника подіями жорсткого РЧ",
            "Імовірність порушення дедлайну подіями м'якого РЧ",
            "Імовірність порушення дедлайну подіями жорсткого РЧ"
            ]